import numpy

m1 = numpy.mat([[1.0,2.0],[3.0,4.0]],float)  
m2 = numpy.mat([[-2,1],[1.5,-0.5]])
print(type(m1)) 
print("------------------------------")
print(m1)
print("------------------------------")
print(m1.I)
print("------------------------------") 
print(m1.I  * m1)
print("------------------------------") 
print(m2  * m1)

print("------------------------------") 
#
#  求解下列方程组
#   2x+3y=3
#   x-4y=10
#  矩阵法：
#  [2, 3   * [x =  [3 
#   1,-4]     y]    10]
#   [x   =   [2, 3   的逆矩阵 *   [3 
#    y]       1,-4]               10]
A = numpy.mat([[2,3],[1,-4]])
v = numpy.mat([[3],[10]])
x = A.I * v
print(x)